-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2020 年 02 月 28 日 00:39
-- 服务器版本: 5.5.53
-- PHP 版本: 5.4.45

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `test`
--

-- --------------------------------------------------------

--
-- 表的结构 `product`
--

CREATE TABLE IF NOT EXISTS `product` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `price` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `img` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `count` int(11) DEFAULT NULL,
  `youhui` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `content` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `classify` int(11) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=55 ;

--
-- 转存表中的数据 `product`
--

INSERT INTO `product` (`Id`, `name`, `price`, `img`, `count`, `youhui`, `content`, `classify`) VALUES
(1, '米花糖', '20.00', 'http://192.168.1.6/img/001.jpg', 566, '买2送1', '这是好吃的米花糖', 1),
(2, '保健品', '288.00', 'http://192.168.1.6/img/002.jpg', 572, '满600减200', '这是壮阳的大保健', 1),
(3, '拖鞋', '15.20', 'http://192.168.1.6/img/003.jpg', 264, '买1送1', '这是走路用的拖鞋', 2),
(4, '鼠标垫', '8.30', 'http://192.168.1.6/img/004.jpg', 677, '送优惠券一张', '这是好玩的鼠标垫', 3),
(5, '笔记本', '4.20', 'http://192.168.1.6/img/005.jpg', 133, '买3送1', '这是好用的笔记本', 6),
(6, '华为手机', '3499.00', 'http://192.168.1.6/img/006.jpg', 79, '赠送充电宝一个', '这是有钱的小手机', 3),
(7, 'JavaScript书本', '85.00', 'http://192.168.1.6/img/007.jpg', 542, '满100减30', '这是脱发的入门籍', 4),
(8, '剃须刀', '325.50', 'http://192.168.1.6/img/008.jpg', 121, '赠送积分100点', '这是男人的大神器', 5),
(9, '充电宝', '89.90', 'http://192.168.1.6/img/009.png', 542, '赠送保存用的口袋一个', '这是充电的充电宝', 5),
(10, '耳机', '557.00', 'http://192.168.1.6/img/010.jpg', 525, '赠送积分200点', '这是听歌的帅耳机', 5),
(11, '男装', '78.50', 'http://192.168.1.6/img/011.png', 57, '买2件减60元', '这是酷炫的男时装', 2),
(12, '钥匙扣', '5.80', 'http://192.168.1.6/img/012.jpg', 571, '买1送1', '这是钥匙的钥匙扣', 8),
(13, '小闹钟', '59.90', 'http://192.168.1.6/img/013.jpg', 56, '赠送电池2枚', '这是灾难的小闹钟', 5),
(14, '卫生纸', '12.80', 'http://192.168.1.6/img/014.jpg', 675, '买2送1', '这是清香的卫生纸', 7),
(15, '水笔', '11.90', 'http://192.168.1.6/img/015.jpg', 520, '赠送笔记本一个', '这是马良的神水笔', 6),
(16, '橡皮擦', '8.50', 'http://192.168.1.6/img/016.jpg', 2313, '买2送1', '这是好用的橡皮擦', 6),
(17, '盘子', '20.20', 'http://192.168.1.6/img/017.jpg', 659, '买1送1', '这是陶瓷的载物碟', 7),
(18, '洗洁精', '12.80', 'http://192.168.1.6/img/018.jpg', 354, '买1送1', '这是清洁的洗碟水', 7),
(19, '米花糖2', '20.00', 'http://192.168.1.6/img/001.jpg', 566, '买2送1', '这是好吃的米花糖', 1),
(20, '保健品2', '288.00', 'http://192.168.1.6/img/002.jpg', 572, '满600减200', '这是壮阳的大保健', 1),
(21, '拖鞋2', '15.20', 'http://192.168.1.6/img/003.jpg', 264, '买1送1', '这是走路用的拖鞋', 2),
(22, '鼠标垫2', '8.30', 'http://192.168.1.6/img/004.jpg', 677, '送优惠券一张', '这是好玩的鼠标垫', 3),
(23, '笔记本2', '4.20', 'http://192.168.1.6/img/005.jpg', 133, '买3送1', '这是好用的笔记本', 6),
(24, '华为手机2', '3499.00', 'http://192.168.1.6/img/006.jpg', 79, '赠送充电宝一个', '这是有钱的小手机', 3),
(25, 'JavaScript书本2', '85.00', 'http://192.168.1.6/img/007.jpg', 542, '满100减30', '这是脱发的入门籍', 4),
(26, '剃须刀2', '325.50', 'http://192.168.1.6/img/008.jpg', 121, '赠送积分100点', '这是男人的大神器', 5),
(27, '充电宝2', '89.90', 'http://192.168.1.6/img/009.png', 542, '赠送保存用的口袋一个', '这是充电的充电宝', 5),
(28, '耳机2', '557.00', 'http://192.168.1.6/img/010.jpg', 525, '赠送积分200点', '这是听歌的帅耳机', 5),
(29, '男装2', '78.50', 'http://192.168.1.6/img/011.png', 57, '买2件减60元', '这是酷炫的男时装', 2),
(30, '钥匙扣2', '5.80', 'http://192.168.1.6/img/012.jpg', 571, '买1送1', '这是钥匙的钥匙扣', 8),
(31, '小闹钟2', '59.90', 'http://192.168.1.6/img/013.jpg', 56, '赠送电池2枚', '这是灾难的小闹钟', 5),
(32, '卫生纸2', '12.80', 'http://192.168.1.6/img/014.jpg', 675, '买2送1', '这是清香的卫生纸', 7),
(33, '水笔2', '11.90', 'http://192.168.1.6/img/015.jpg', 520, '赠送笔记本一个', '这是马良的神水笔', 6),
(34, '橡皮擦2', '8.50', 'http://192.168.1.6/img/016.jpg', 2313, '买2送1', '这是好用的橡皮擦', 6),
(35, '盘子2', '20.20', 'http://192.168.1.6/img/017.jpg', 659, '买1送1', '这是陶瓷的载物碟', 7),
(36, '洗洁精2', '12.80', 'http://192.168.1.6/img/018.jpg', 354, '买1送1', '这是清洁的洗碟水', 7),
(37, '米花糖3', '20.00', 'http://192.168.1.6/img/001.jpg', 566, '买2送1', '这是好吃的米花糖', 1),
(38, '保健品3', '288.00', 'http://192.168.1.6/img/002.jpg', 572, '满600减200', '这是壮阳的大保健', 1),
(39, '拖鞋3', '15.20', 'http://192.168.1.6/img/003.jpg', 264, '买1送1', '这是走路用的拖鞋', 2),
(40, '鼠标垫3', '8.30', 'http://192.168.1.6/img/004.jpg', 677, '送优惠券一张', '这是好玩的鼠标垫', 3),
(41, '笔记本3', '4.20', 'http://192.168.1.6/img/005.jpg', 133, '买3送1', '这是好用的笔记本', 6),
(42, '华为手机3', '3499.00', 'http://192.168.1.6/img/006.jpg', 79, '赠送充电宝一个', '这是有钱的小手机', 3),
(43, 'JavaScript书本3', '85.00', 'http://192.168.1.6/img/007.jpg', 542, '满100减30', '这是脱发的入门籍', 4),
(44, '剃须刀3', '325.50', 'http://192.168.1.6/img/008.jpg', 121, '赠送积分100点', '这是男人的大神器', 5),
(45, '充电宝3', '89.90', 'http://192.168.1.6/img/009.png', 542, '赠送保存用的口袋一个', '这是充电的充电宝', 5),
(46, '耳机3', '557.00', 'http://192.168.1.6/img/010.jpg', 525, '赠送积分200点', '这是听歌的帅耳机', 5),
(47, '男装3', '78.50', 'http://192.168.1.6/img/011.png', 57, '买2件减60元', '这是酷炫的男时装', 2),
(48, '钥匙扣3', '5.80', 'http://192.168.1.6/img/012.jpg', 571, '买1送1', '这是钥匙的钥匙扣', 8),
(49, '小闹钟3', '59.90', 'http://192.168.1.6/img/013.jpg', 56, '赠送电池2枚', '这是灾难的小闹钟', 5),
(50, '卫生纸3', '12.80', 'http://192.168.1.6/img/014.jpg', 675, '买2送1', '这是清香的卫生纸', 7),
(51, '水笔3', '11.90', 'http://192.168.1.6/img/015.jpg', 520, '赠送笔记本一个', '这是马良的神水笔', 6),
(52, '橡皮擦3', '8.50', 'http://192.168.1.6/img/016.jpg', 2313, '买2送1', '这是好用的橡皮擦', 6),
(53, '盘子3', '20.20', 'http://192.168.1.6/img/017.jpg', 659, '买1送1', '这是陶瓷的载物碟', 7),
(54, '洗洁精3', '12.80', 'http://192.168.1.6/img/001.jpg', 354, '买1送1', '这是清洁的洗碟水', 7);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
